IzayoiSakuyaRemi/Human_Face_Recognition/sdkconfig.defaults
# ── Target chip ──────────────────────────────
CONFIG_IDF_TARGET="esp32s3"
# ── Serial flasher ──────────────────────────
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# ── CPU ────────────────────────────────────
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
# ── Wi-Fi (tuned for xiaozhi: 24 RX buffers saves ~160KB internal SRAM) ──
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=5
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=24
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=10
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
# ── LWIP ────────────────────────────────────
CONFIG_LWIP_ENABLE=y
# ── MQTT + TLS for xiaozhi ──────────────────
CONFIG_MQTT_ENABLED=y
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
# ── FreeRTOS ────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
# CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1 is not set
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
# ── Compiler ────────────────────────────────
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set (1MB too small for xiaozhi+Opus)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
# ── mbedTLS (match xiaozhi's working config) ──
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# CONFIG_MBEDTLS_SSL_RENEGOTIATION is not set
# CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE is not set
# ── PSRAM (8MB Octal) ────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_MEMTEST=y
